<template>
    <Teleport to="#nav">
        <div class="sidebar" :class="{show: isShow}">
            <div class="trigger"  @click="isShow = !isShow">
                <fa class="icon fc" :icon="isShow? 'angle-left': 'angle-right'"/>
            </div>
            <div class="mode block">
                {{ conditionStore.mode==="sell"? "売買": "賃貸"}}
            </div>

            <div class="fc-wrapper">
                <FirstCondition v-for="(fc, index) in fcs" :title="fc.title" :fc="fc.values[cityIndex]" :index="index"></FirstCondition>
            </div>
            
            <div class="block">
                前回の検索条件
            </div>

            <div class="last-search">
                東京都、千代田区、賃貸、1LDK、10万
            </div>
        </div>
    </Teleport>
</template>
    
<script setup>
    import FirstCondition from './FirstCondition.vue';

    import { ref, computed } from 'vue';

    import { useConditionStore } from '@/stores/condition'
    const conditionStore = useConditionStore()

    // 根据城市，显示不同的fc(first condition)
    const cityIndex = computed(() => {
        return conditionStore.cityIndex
    })
    const fcs = [
        {
            title: "エリアから",
            values: {
                1: ["千代田区", "中央区", "港区", "新宿区", "文京区", "渋谷区", "台東区", "墨田区", "江東区", "荒川区", "足立区", "葛飾区", "江戸川区", "品川区", "目黒区", "大田区", "世田谷区", "中野区", "杉並区", "練馬区", "豊島区", "北区", "板橋区", "八王子市", "横浜市鶴見区", "横浜市神奈川区", "横浜市西区", "横浜市中区", "横浜市南区", "横浜市保土ケ谷区", "横浜市磯子区", "横浜市港北区", "横浜市戸塚区", "横浜市港南区", "横浜市旭区", "横浜市緑区", "横浜市栄区", "横浜市青葉区", "横浜市都筑区", "川崎市川崎区", "川崎市幸区", "川崎市中原区", "川崎市高津区", "川崎市多摩区", "川崎市宮前区", "川崎市麻生区", "相模原市緑区", "相模原市中央区", "相模原市南区", "横須賀市", "平塚市", "鎌倉市", "藤沢市", "小田原市", "茅ヶ崎市", "三浦市", "秦野市", "厚木市", "大和市", "海老名市", "座間市", "高崎市", "宇都宮市", "小山市", "千葉市中央区", "千葉市花見川区", "千葉市稲毛区", "千葉市美浜区", "市川市", "船橋市", "松戸市", "野田市", "成田市", "佐倉市", "習志野市", "柏市", "市原市", "流山市", "八千代市", "鎌ケ谷市", "浦安市", "水戸市", "日立市", "古河市", "つくば市", "守谷市", "立川市", "武蔵野市", "三鷹市", "青梅市", "府中市", "昭島市", "調布市", "町田市", "小金井市", "小平市", "日野市", "国立市", "福生市", "狛江市", "多摩市", "西東京市"],
                2: ["千代田区", "中央区", "港区", "新宿区", "文京区", "渋谷区", "台東区", "墨田区", "江東区", "荒川区", "足立区", "葛飾区", "江戸川区", "品川区", "目黒区", "大田区", "世田谷区", "中野区", "杉並区", "練馬区", "豊島区", "北区", "板橋区", "八王子市", "横浜市鶴見区", "横浜市神奈川区", "横浜市西区", "横浜市中区", "横浜市南区", "横浜市保土ケ谷区", "横浜市磯子区", "横浜市港北区", "横浜市戸塚区", "横浜市港南区", "横浜市旭区", "横浜市緑区", "横浜市栄区", "横浜市青葉区", "横浜市都筑区", "川崎市川崎区", "川崎市幸区", "川崎市中原区", "川崎市高津区", "川崎市多摩区", "川崎市宮前区", "川崎市麻生区", "相模原市緑区", "相模原市中央区", "相模原市南区", "横須賀市", "平塚市", "鎌倉市", "藤沢市", "小田原市", "茅ヶ崎市", "三浦市", "秦野市", "厚木市", "大和市", "海老名市", "座間市", "高崎市", "宇都宮市", "小山市", "千葉市中央区", "千葉市花見川区", "千葉市稲毛区", "千葉市美浜区", "市川市", "船橋市", "松戸市", "野田市", "成田市", "佐倉市", "習志野市", "柏市", "市原市", "流山市", "八千代市", "鎌ケ谷市", "浦安市", "水戸市", "日立市", "古河市", "つくば市", "守谷市", "立川市", "武蔵野市", "三鷹市", "青梅市", "府中市", "昭島市", "調布市", "町田市", "小金井市", "小平市", "日野市", "国立市", "福生市", "狛江市", "多摩市", "西東京市"],
                3: ["千代田区", "中央区", "港区", "新宿区", "文京区", "渋谷区", "台東区", "墨田区", "江東区", "荒川区", "足立区", "葛飾区", "江戸川区", "品川区", "目黒区", "大田区", "世田谷区", "中野区", "杉並区", "練馬区", "豊島区", "北区", "板橋区", "八王子市", "横浜市鶴見区", "横浜市神奈川区", "横浜市西区", "横浜市中区", "横浜市南区", "横浜市保土ケ谷区", "横浜市磯子区", "横浜市港北区", "横浜市戸塚区", "横浜市港南区", "横浜市旭区", "横浜市緑区", "横浜市栄区", "横浜市青葉区", "横浜市都筑区", "川崎市川崎区", "川崎市幸区", "川崎市中原区", "川崎市高津区", "川崎市多摩区", "川崎市宮前区", "川崎市麻生区", "相模原市緑区", "相模原市中央区", "相模原市南区", "横須賀市", "平塚市", "鎌倉市", "藤沢市", "小田原市", "茅ヶ崎市", "三浦市", "秦野市", "厚木市", "大和市", "海老名市", "座間市", "高崎市", "宇都宮市", "小山市", "千葉市中央区", "千葉市花見川区", "千葉市稲毛区", "千葉市美浜区", "市川市", "船橋市", "松戸市", "野田市", "成田市", "佐倉市", "習志野市", "柏市", "市原市", "流山市", "八千代市", "鎌ケ谷市", "浦安市", "水戸市", "日立市", "古河市", "つくば市", "守谷市", "立川市", "武蔵野市", "三鷹市", "青梅市", "府中市", "昭島市", "調布市", "町田市", "小金井市", "小平市", "日野市", "国立市", "福生市", "狛江市", "多摩市", "西東京市"],
                4: ["千代田区", "中央区", "港区", "新宿区", "文京区", "渋谷区", "台東区", "墨田区", "江東区", "荒川区", "足立区", "葛飾区", "江戸川区", "品川区", "目黒区", "大田区", "世田谷区", "中野区", "杉並区", "練馬区", "豊島区", "北区", "板橋区", "八王子市", "横浜市鶴見区", "横浜市神奈川区", "横浜市西区", "横浜市中区", "横浜市南区", "横浜市保土ケ谷区", "横浜市磯子区", "横浜市港北区", "横浜市戸塚区", "横浜市港南区", "横浜市旭区", "横浜市緑区", "横浜市栄区", "横浜市青葉区", "横浜市都筑区", "川崎市川崎区", "川崎市幸区", "川崎市中原区", "川崎市高津区", "川崎市多摩区", "川崎市宮前区", "川崎市麻生区", "相模原市緑区", "相模原市中央区", "相模原市南区", "横須賀市", "平塚市", "鎌倉市", "藤沢市", "小田原市", "茅ヶ崎市", "三浦市", "秦野市", "厚木市", "大和市", "海老名市", "座間市", "高崎市", "宇都宮市", "小山市", "千葉市中央区", "千葉市花見川区", "千葉市稲毛区", "千葉市美浜区", "市川市", "船橋市", "松戸市", "野田市", "成田市", "佐倉市", "習志野市", "柏市", "市原市", "流山市", "八千代市", "鎌ケ谷市", "浦安市", "水戸市", "日立市", "古河市", "つくば市", "守谷市", "立川市", "武蔵野市", "三鷹市", "青梅市", "府中市", "昭島市", "調布市", "町田市", "小金井市", "小平市", "日野市", "国立市", "福生市", "狛江市", "多摩市", "西東京市"],
            }
        },
        {
            title: "駅から",
            values: {
                1: ["曳舟", "原宿", "新小岩", "末広町", "高田馬場", "大島", "表参道", "梅屋敷", "大崎広小路", "練馬", "東銀座", "小作", "登戸", "菊川", "船橋", "奥沢", "鐘ヶ淵", "目黒", "荒川二丁目", "草加", "王子", "浜川崎", "要町", "代官山", "新柏", "大塚", "田無", "後楽園", "麻布十番", "森下", "上町", "巣鴨", "青山一丁目", "戸越銀座", "六本木", "新板橋", "西大井", "三鷹", "千葉中央", "鮫洲", "平和島", "京成小岩", "竹橋", "お台場海浜公園", "とうきょうスカイツリー", "元住吉", "春日", "芝公園", "北池袋", "稲城長沼", "市場前", "栄町", "千駄ヶ谷", "銀座", "浜町", "戸越公園", "西日暮里", "木場", "田原町", "根津", "東雲", "人形町", "三ノ輪橋", "橋本", "中村橋", "水天宮前", "半蔵門", "西大島", "小川町", "御徒町", "青砥", "新橋", "武蔵小杉", "仲御徒町", "府中", "恵比寿", "茗荷谷", "茅場町", "二俣川", "新宿御苑前", "池尻大橋", "勝どき", "東池袋四丁目", "駒場東大前", "糀谷", "南新宿", "赤羽岩淵", "飛鳥山", "田端", "自由が丘", "白金台", "幡ヶ谷", "町屋駅前", "渋谷", "信濃町", "東京テレポート", "綱島", "練馬春日町", "五反田", "東あずま", "赤坂見附", "宮崎台", "西葛西", "東池袋", "水道橋", "等々力", "両国", "霞ヶ関", "宝町", "巣鴨新田", "押上", "九段下", "牛込神楽坂", "千住大橋", "東新宿", "東高円寺", "庚申塚", "北小金", "中野", "牛込柳町", "飯田橋", "三越前", "初台", "府中本町", "本駒込", "東京", "高輪ゲートウェイ", "大口", "八丁堀", "竹ノ塚", "平沼橋", "四ツ谷", "面影橋", "東長崎", "清澄白河", "新大久保", "大久保", "中野坂上", "上野毛", "西横浜", "錦糸町", "東陽町", "上野", "鶯谷", "お花茶屋", "白金高輪", "大井町", "東向島", "天王洲アイル", "八丁畷", "京橋", "尾山台", "青物横丁", "稲荷町", "根岸", "代田橋", "乃木坂", "洗足", "高輪台", "浅草橋", "東十条", "西新井", "池袋", "田園調布", "元山", "あざみ野", "荒川一中前", "荏原中延", "東大島", "亀有", "上野広小路", "東中野", "新宿三丁目", "沼袋", "代々木公園", "五香", "銀座一丁目", "大門", "西馬込", "新富町", "天王町", "市川大野", "品川シーサイド", "武蔵新田", "馬喰横山", "永田町", "京急蒲田", "磯子", "八千代台", "東神奈川", "蒲田", "戸越", "新宿", "新宿西口", "牛田", "日の出", "金町", "新馬場", "淡路町", "上中里", "国立競技場", "内幸町", "黄金町", "上北沢", "菊名", "千駄木", "明治神宮前", "荏原町", "板橋", "二子玉川", "御茶ノ水", "馬喰町", "日ノ出町", "たまプラーザ", "新御徒町", "赤坂", "竹芝", "蓮沼", "築地", "蔵前", "代々木八幡", "神楽坂", "玉川学園前", "新庚申塚", "越中島", "千歳烏山", "三田", "平井", "亀戸水神", "川崎", "不動前", "千葉", "駒込", "西巣鴨", "南阿佐ヶ谷", "光が丘", "白山", "東大前", "多摩境", "北千住", "入谷", "早稲田", "柏の葉キャンパス", "御成門", "有楽町", "門前仲町", "三軒茶屋", "上野御徒町", "新丸子", "四谷三丁目", "品川", "築地市場", "神保町", "立会川", "京王多摩センター", "宮前平", "京成上野", "東門前", "北品川", "三ノ輪", "参宮橋", "八広", "豊洲", "日吉", "石川町", "北参道", "一之江", "笹塚", "三河島", "大森海岸", "虎ノ門", "有明テニスの森", "桜新町", "南砂町", "潮見", "富士見台", "六本木一丁目", "西新宿五丁目", "下井草", "芝浦ふ頭", "西早稲田", "三郷中央", "辰巳", "下落合", "立川", "椎名町", "大神宮下", "四ツ木", "浦安", "梅島", "若松河田", "石川台", "下板橋", "新大塚", "阿佐ヶ谷", "溜池山王", "南千住", "神泉", "京急川崎", "神田", "雑司が谷", "町屋", "本郷三丁目", "落合南長崎", "外苑前", "向原", "市ヶ谷", "多摩センター", "新三河島", "秋葉原", "代々木", "雑色", "宿河原", "国会議事堂前", "湯島", "地下鉄成増", "本所吾妻橋", "雪が谷大塚", "新御茶ノ水", "高円寺", "大森町", "泉岳寺", "大森", "日暮里", "南柏", "新日本橋", "江戸川橋", "月島", "代々木上原", "大崎", "千鳥町", "鶴ヶ峰", "神谷町", "京急東神奈川", "新中野", "赤羽橋", "王子駅前", "目白", "新代田", "国際展示場", "新木場", "汐留", "住吉", "岩本町", "舎人", "桜上水", "西小山", "京成金町", "赤羽", "護国寺", "亀戸", "新豊洲", "曙橋", "戸部", "新井薬師前", "武蔵小山", "千石", "日本橋", "馬込", "西武新宿", "大手町", "中井", "鵜の木", "吉祥寺", "田町", "武蔵関", "京成曳舟", "横浜", "鴨宮", "小村井", "小岩", "浅草", "中延", "小伝馬町", "落合", "向河原", "下神明", "荒川区役所前", "葛西", "北赤羽", "西ヶ原", "綾瀬", "有明", "関内", "妙蓮寺", "西国立", "都庁前", "船堀", "南行徳", "広尾", "西新宿", "麹町", "王子神谷", "大岡山", "東日本橋", "中目黒", "浜松町", "稲城", "川崎大師", "多摩川"],
                2: ["曳舟", "原宿", "新小岩", "末広町", "高田馬場", "大島", "表参道", "梅屋敷", "大崎広小路", "練馬", "東銀座", "小作", "登戸", "菊川", "船橋", "奥沢", "鐘ヶ淵", "目黒", "荒川二丁目", "草加", "王子", "浜川崎", "要町", "代官山", "新柏", "大塚", "田無", "後楽園", "麻布十番", "森下", "上町", "巣鴨", "青山一丁目", "戸越銀座", "六本木", "新板橋", "西大井", "三鷹", "千葉中央", "鮫洲", "平和島", "京成小岩", "竹橋", "お台場海浜公園", "とうきょうスカイツリー", "元住吉", "春日", "芝公園", "北池袋", "稲城長沼", "市場前", "栄町", "千駄ヶ谷", "銀座", "浜町", "戸越公園", "西日暮里", "木場", "田原町", "根津", "東雲", "人形町", "三ノ輪橋", "橋本", "中村橋", "水天宮前", "半蔵門", "西大島", "小川町", "御徒町", "青砥", "新橋", "武蔵小杉", "仲御徒町", "府中", "恵比寿", "茗荷谷", "茅場町", "二俣川", "新宿御苑前", "池尻大橋", "勝どき", "東池袋四丁目", "駒場東大前", "糀谷", "南新宿", "赤羽岩淵", "飛鳥山", "田端", "自由が丘", "白金台", "幡ヶ谷", "町屋駅前", "渋谷", "信濃町", "東京テレポート", "綱島", "練馬春日町", "五反田", "東あずま", "赤坂見附", "宮崎台", "西葛西", "東池袋", "水道橋", "等々力", "両国", "霞ヶ関", "宝町", "巣鴨新田", "押上", "九段下", "牛込神楽坂", "千住大橋", "東新宿", "東高円寺", "庚申塚", "北小金", "中野", "牛込柳町", "飯田橋", "三越前", "初台", "府中本町", "本駒込", "東京", "高輪ゲートウェイ", "大口", "八丁堀", "竹ノ塚", "平沼橋", "四ツ谷", "面影橋", "東長崎", "清澄白河", "新大久保", "大久保", "中野坂上", "上野毛", "西横浜", "錦糸町", "東陽町", "上野", "鶯谷", "お花茶屋", "白金高輪", "大井町", "東向島", "天王洲アイル", "八丁畷", "京橋", "尾山台", "青物横丁", "稲荷町", "根岸", "代田橋", "乃木坂", "洗足", "高輪台", "浅草橋", "東十条", "西新井", "池袋", "田園調布", "元山", "あざみ野", "荒川一中前", "荏原中延", "東大島", "亀有", "上野広小路", "東中野", "新宿三丁目", "沼袋", "代々木公園", "五香", "銀座一丁目", "大門", "西馬込", "新富町", "天王町", "市川大野", "品川シーサイド", "武蔵新田", "馬喰横山", "永田町", "京急蒲田", "磯子", "八千代台", "東神奈川", "蒲田", "戸越", "新宿", "新宿西口", "牛田", "日の出", "金町", "新馬場", "淡路町", "上中里", "国立競技場", "内幸町", "黄金町", "上北沢", "菊名", "千駄木", "明治神宮前", "荏原町", "板橋", "二子玉川", "御茶ノ水", "馬喰町", "日ノ出町", "たまプラーザ", "新御徒町", "赤坂", "竹芝", "蓮沼", "築地", "蔵前", "代々木八幡", "神楽坂", "玉川学園前", "新庚申塚", "越中島", "千歳烏山", "三田", "平井", "亀戸水神", "川崎", "不動前", "千葉", "駒込", "西巣鴨", "南阿佐ヶ谷", "光が丘", "白山", "東大前", "多摩境", "北千住", "入谷", "早稲田", "柏の葉キャンパス", "御成門", "有楽町", "門前仲町", "三軒茶屋", "上野御徒町", "新丸子", "四谷三丁目", "品川", "築地市場", "神保町", "立会川", "京王多摩センター", "宮前平", "京成上野", "東門前", "北品川", "三ノ輪", "参宮橋", "八広", "豊洲", "日吉", "石川町", "北参道", "一之江", "笹塚", "三河島", "大森海岸", "虎ノ門", "有明テニスの森", "桜新町", "南砂町", "潮見", "富士見台", "六本木一丁目", "西新宿五丁目", "下井草", "芝浦ふ頭", "西早稲田", "三郷中央", "辰巳", "下落合", "立川", "椎名町", "大神宮下", "四ツ木", "浦安", "梅島", "若松河田", "石川台", "下板橋", "新大塚", "阿佐ヶ谷", "溜池山王", "南千住", "神泉", "京急川崎", "神田", "雑司が谷", "町屋", "本郷三丁目", "落合南長崎", "外苑前", "向原", "市ヶ谷", "多摩センター", "新三河島", "秋葉原", "代々木", "雑色", "宿河原", "国会議事堂前", "湯島", "地下鉄成増", "本所吾妻橋", "雪が谷大塚", "新御茶ノ水", "高円寺", "大森町", "泉岳寺", "大森", "日暮里", "南柏", "新日本橋", "江戸川橋", "月島", "代々木上原", "大崎", "千鳥町", "鶴ヶ峰", "神谷町", "京急東神奈川", "新中野", "赤羽橋", "王子駅前", "目白", "新代田", "国際展示場", "新木場", "汐留", "住吉", "岩本町", "舎人", "桜上水", "西小山", "京成金町", "赤羽", "護国寺", "亀戸", "新豊洲", "曙橋", "戸部", "新井薬師前", "武蔵小山", "千石", "日本橋", "馬込", "西武新宿", "大手町", "中井", "鵜の木", "吉祥寺", "田町", "武蔵関", "京成曳舟", "横浜", "鴨宮", "小村井", "小岩", "浅草", "中延", "小伝馬町", "落合", "向河原", "下神明", "荒川区役所前", "葛西", "北赤羽", "西ヶ原", "綾瀬", "有明", "関内", "妙蓮寺", "西国立", "都庁前", "船堀", "南行徳", "広尾", "西新宿", "麹町", "王子神谷", "大岡山", "東日本橋", "中目黒", "浜松町", "稲城", "川崎大師", "多摩川"],
                3: ["曳舟", "原宿", "新小岩", "末広町", "高田馬場", "大島", "表参道", "梅屋敷", "大崎広小路", "練馬", "東銀座", "小作", "登戸", "菊川", "船橋", "奥沢", "鐘ヶ淵", "目黒", "荒川二丁目", "草加", "王子", "浜川崎", "要町", "代官山", "新柏", "大塚", "田無", "後楽園", "麻布十番", "森下", "上町", "巣鴨", "青山一丁目", "戸越銀座", "六本木", "新板橋", "西大井", "三鷹", "千葉中央", "鮫洲", "平和島", "京成小岩", "竹橋", "お台場海浜公園", "とうきょうスカイツリー", "元住吉", "春日", "芝公園", "北池袋", "稲城長沼", "市場前", "栄町", "千駄ヶ谷", "銀座", "浜町", "戸越公園", "西日暮里", "木場", "田原町", "根津", "東雲", "人形町", "三ノ輪橋", "橋本", "中村橋", "水天宮前", "半蔵門", "西大島", "小川町", "御徒町", "青砥", "新橋", "武蔵小杉", "仲御徒町", "府中", "恵比寿", "茗荷谷", "茅場町", "二俣川", "新宿御苑前", "池尻大橋", "勝どき", "東池袋四丁目", "駒場東大前", "糀谷", "南新宿", "赤羽岩淵", "飛鳥山", "田端", "自由が丘", "白金台", "幡ヶ谷", "町屋駅前", "渋谷", "信濃町", "東京テレポート", "綱島", "練馬春日町", "五反田", "東あずま", "赤坂見附", "宮崎台", "西葛西", "東池袋", "水道橋", "等々力", "両国", "霞ヶ関", "宝町", "巣鴨新田", "押上", "九段下", "牛込神楽坂", "千住大橋", "東新宿", "東高円寺", "庚申塚", "北小金", "中野", "牛込柳町", "飯田橋", "三越前", "初台", "府中本町", "本駒込", "東京", "高輪ゲートウェイ", "大口", "八丁堀", "竹ノ塚", "平沼橋", "四ツ谷", "面影橋", "東長崎", "清澄白河", "新大久保", "大久保", "中野坂上", "上野毛", "西横浜", "錦糸町", "東陽町", "上野", "鶯谷", "お花茶屋", "白金高輪", "大井町", "東向島", "天王洲アイル", "八丁畷", "京橋", "尾山台", "青物横丁", "稲荷町", "根岸", "代田橋", "乃木坂", "洗足", "高輪台", "浅草橋", "東十条", "西新井", "池袋", "田園調布", "元山", "あざみ野", "荒川一中前", "荏原中延", "東大島", "亀有", "上野広小路", "東中野", "新宿三丁目", "沼袋", "代々木公園", "五香", "銀座一丁目", "大門", "西馬込", "新富町", "天王町", "市川大野", "品川シーサイド", "武蔵新田", "馬喰横山", "永田町", "京急蒲田", "磯子", "八千代台", "東神奈川", "蒲田", "戸越", "新宿", "新宿西口", "牛田", "日の出", "金町", "新馬場", "淡路町", "上中里", "国立競技場", "内幸町", "黄金町", "上北沢", "菊名", "千駄木", "明治神宮前", "荏原町", "板橋", "二子玉川", "御茶ノ水", "馬喰町", "日ノ出町", "たまプラーザ", "新御徒町", "赤坂", "竹芝", "蓮沼", "築地", "蔵前", "代々木八幡", "神楽坂", "玉川学園前", "新庚申塚", "越中島", "千歳烏山", "三田", "平井", "亀戸水神", "川崎", "不動前", "千葉", "駒込", "西巣鴨", "南阿佐ヶ谷", "光が丘", "白山", "東大前", "多摩境", "北千住", "入谷", "早稲田", "柏の葉キャンパス", "御成門", "有楽町", "門前仲町", "三軒茶屋", "上野御徒町", "新丸子", "四谷三丁目", "品川", "築地市場", "神保町", "立会川", "京王多摩センター", "宮前平", "京成上野", "東門前", "北品川", "三ノ輪", "参宮橋", "八広", "豊洲", "日吉", "石川町", "北参道", "一之江", "笹塚", "三河島", "大森海岸", "虎ノ門", "有明テニスの森", "桜新町", "南砂町", "潮見", "富士見台", "六本木一丁目", "西新宿五丁目", "下井草", "芝浦ふ頭", "西早稲田", "三郷中央", "辰巳", "下落合", "立川", "椎名町", "大神宮下", "四ツ木", "浦安", "梅島", "若松河田", "石川台", "下板橋", "新大塚", "阿佐ヶ谷", "溜池山王", "南千住", "神泉", "京急川崎", "神田", "雑司が谷", "町屋", "本郷三丁目", "落合南長崎", "外苑前", "向原", "市ヶ谷", "多摩センター", "新三河島", "秋葉原", "代々木", "雑色", "宿河原", "国会議事堂前", "湯島", "地下鉄成増", "本所吾妻橋", "雪が谷大塚", "新御茶ノ水", "高円寺", "大森町", "泉岳寺", "大森", "日暮里", "南柏", "新日本橋", "江戸川橋", "月島", "代々木上原", "大崎", "千鳥町", "鶴ヶ峰", "神谷町", "京急東神奈川", "新中野", "赤羽橋", "王子駅前", "目白", "新代田", "国際展示場", "新木場", "汐留", "住吉", "岩本町", "舎人", "桜上水", "西小山", "京成金町", "赤羽", "護国寺", "亀戸", "新豊洲", "曙橋", "戸部", "新井薬師前", "武蔵小山", "千石", "日本橋", "馬込", "西武新宿", "大手町", "中井", "鵜の木", "吉祥寺", "田町", "武蔵関", "京成曳舟", "横浜", "鴨宮", "小村井", "小岩", "浅草", "中延", "小伝馬町", "落合", "向河原", "下神明", "荒川区役所前", "葛西", "北赤羽", "西ヶ原", "綾瀬", "有明", "関内", "妙蓮寺", "西国立", "都庁前", "船堀", "南行徳", "広尾", "西新宿", "麹町", "王子神谷", "大岡山", "東日本橋", "中目黒", "浜松町", "稲城", "川崎大師", "多摩川"],
                4: ["曳舟", "原宿", "新小岩", "末広町", "高田馬場", "大島", "表参道", "梅屋敷", "大崎広小路", "練馬", "東銀座", "小作", "登戸", "菊川", "船橋", "奥沢", "鐘ヶ淵", "目黒", "荒川二丁目", "草加", "王子", "浜川崎", "要町", "代官山", "新柏", "大塚", "田無", "後楽園", "麻布十番", "森下", "上町", "巣鴨", "青山一丁目", "戸越銀座", "六本木", "新板橋", "西大井", "三鷹", "千葉中央", "鮫洲", "平和島", "京成小岩", "竹橋", "お台場海浜公園", "とうきょうスカイツリー", "元住吉", "春日", "芝公園", "北池袋", "稲城長沼", "市場前", "栄町", "千駄ヶ谷", "銀座", "浜町", "戸越公園", "西日暮里", "木場", "田原町", "根津", "東雲", "人形町", "三ノ輪橋", "橋本", "中村橋", "水天宮前", "半蔵門", "西大島", "小川町", "御徒町", "青砥", "新橋", "武蔵小杉", "仲御徒町", "府中", "恵比寿", "茗荷谷", "茅場町", "二俣川", "新宿御苑前", "池尻大橋", "勝どき", "東池袋四丁目", "駒場東大前", "糀谷", "南新宿", "赤羽岩淵", "飛鳥山", "田端", "自由が丘", "白金台", "幡ヶ谷", "町屋駅前", "渋谷", "信濃町", "東京テレポート", "綱島", "練馬春日町", "五反田", "東あずま", "赤坂見附", "宮崎台", "西葛西", "東池袋", "水道橋", "等々力", "両国", "霞ヶ関", "宝町", "巣鴨新田", "押上", "九段下", "牛込神楽坂", "千住大橋", "東新宿", "東高円寺", "庚申塚", "北小金", "中野", "牛込柳町", "飯田橋", "三越前", "初台", "府中本町", "本駒込", "東京", "高輪ゲートウェイ", "大口", "八丁堀", "竹ノ塚", "平沼橋", "四ツ谷", "面影橋", "東長崎", "清澄白河", "新大久保", "大久保", "中野坂上", "上野毛", "西横浜", "錦糸町", "東陽町", "上野", "鶯谷", "お花茶屋", "白金高輪", "大井町", "東向島", "天王洲アイル", "八丁畷", "京橋", "尾山台", "青物横丁", "稲荷町", "根岸", "代田橋", "乃木坂", "洗足", "高輪台", "浅草橋", "東十条", "西新井", "池袋", "田園調布", "元山", "あざみ野", "荒川一中前", "荏原中延", "東大島", "亀有", "上野広小路", "東中野", "新宿三丁目", "沼袋", "代々木公園", "五香", "銀座一丁目", "大門", "西馬込", "新富町", "天王町", "市川大野", "品川シーサイド", "武蔵新田", "馬喰横山", "永田町", "京急蒲田", "磯子", "八千代台", "東神奈川", "蒲田", "戸越", "新宿", "新宿西口", "牛田", "日の出", "金町", "新馬場", "淡路町", "上中里", "国立競技場", "内幸町", "黄金町", "上北沢", "菊名", "千駄木", "明治神宮前", "荏原町", "板橋", "二子玉川", "御茶ノ水", "馬喰町", "日ノ出町", "たまプラーザ", "新御徒町", "赤坂", "竹芝", "蓮沼", "築地", "蔵前", "代々木八幡", "神楽坂", "玉川学園前", "新庚申塚", "越中島", "千歳烏山", "三田", "平井", "亀戸水神", "川崎", "不動前", "千葉", "駒込", "西巣鴨", "南阿佐ヶ谷", "光が丘", "白山", "東大前", "多摩境", "北千住", "入谷", "早稲田", "柏の葉キャンパス", "御成門", "有楽町", "門前仲町", "三軒茶屋", "上野御徒町", "新丸子", "四谷三丁目", "品川", "築地市場", "神保町", "立会川", "京王多摩センター", "宮前平", "京成上野", "東門前", "北品川", "三ノ輪", "参宮橋", "八広", "豊洲", "日吉", "石川町", "北参道", "一之江", "笹塚", "三河島", "大森海岸", "虎ノ門", "有明テニスの森", "桜新町", "南砂町", "潮見", "富士見台", "六本木一丁目", "西新宿五丁目", "下井草", "芝浦ふ頭", "西早稲田", "三郷中央", "辰巳", "下落合", "立川", "椎名町", "大神宮下", "四ツ木", "浦安", "梅島", "若松河田", "石川台", "下板橋", "新大塚", "阿佐ヶ谷", "溜池山王", "南千住", "神泉", "京急川崎", "神田", "雑司が谷", "町屋", "本郷三丁目", "落合南長崎", "外苑前", "向原", "市ヶ谷", "多摩センター", "新三河島", "秋葉原", "代々木", "雑色", "宿河原", "国会議事堂前", "湯島", "地下鉄成増", "本所吾妻橋", "雪が谷大塚", "新御茶ノ水", "高円寺", "大森町", "泉岳寺", "大森", "日暮里", "南柏", "新日本橋", "江戸川橋", "月島", "代々木上原", "大崎", "千鳥町", "鶴ヶ峰", "神谷町", "京急東神奈川", "新中野", "赤羽橋", "王子駅前", "目白", "新代田", "国際展示場", "新木場", "汐留", "住吉", "岩本町", "舎人", "桜上水", "西小山", "京成金町", "赤羽", "護国寺", "亀戸", "新豊洲", "曙橋", "戸部", "新井薬師前", "武蔵小山", "千石", "日本橋", "馬込", "西武新宿", "大手町", "中井", "鵜の木", "吉祥寺", "田町", "武蔵関", "京成曳舟", "横浜", "鴨宮", "小村井", "小岩", "浅草", "中延", "小伝馬町", "落合", "向河原", "下神明", "荒川区役所前", "葛西", "北赤羽", "西ヶ原", "綾瀬", "有明", "関内", "妙蓮寺", "西国立", "都庁前", "船堀", "南行徳", "広尾", "西新宿", "麹町", "王子神谷", "大岡山", "東日本橋", "中目黒", "浜松町", "稲城", "川崎大師", "多摩川"],
            }
        },
        {
            title: "沿線から",
            values: {
                1: ["東急大井町線", "東急東横線", "東急田園都市線", "東急目黒線", "東急新横浜線", "ＪＲ横須賀線", "ＪＲ京浜東北線", "ＪＲ根岸線", "ＪＲ鶴見線", "ＪＲ東海道本線", "ＪＲ南武線", "ＪＲ横浜線", "ＪＲ相模線", "湘南新宿ライン宇須", "湘南新宿ライン高海", "東海道新幹線", "ＪＲ埼京線", "京王相模原線", "京急本線", "京急大師線", "京急久里浜線", "小田急線", "小田急小田原線", "小田急多摩線", "小田急江ノ島線", "相鉄本線", "相鉄いずみ野線", "相鉄新横浜線", "ブルーライン", "グリーンライン", "みなとみらい線", "シーサイドライン", "江ノ島電鉄線", "湘南モノレール", "箱根登山鉄道", "伊豆箱根大雄山線", "ＪＲ山手線", "ＪＲ京浜東北線", "ＪＲ東海道本線", "ＪＲ常磐線", "ＪＲ南武線", "ＪＲ横浜線", "ＪＲ横須賀線", "ＪＲ中央線", "ＪＲ青梅線", "ＪＲ武蔵野線", "ＪＲ八高線", "ＪＲ埼京線", "ＪＲ高崎線", "ＪＲ宇都宮線", "ＪＲ総武線", "ＪＲ総武線快速", "ＪＲ京葉線", "湘南新宿ライン宇須", "湘南新宿ライン高海", "東海道新幹線", "上越新幹線", "北陸新幹線", "東北新幹線", "東京メトロ銀座線", "東京メトロ丸ノ内線", "東京メトロ日比谷線", "東京メトロ東西線", "東京メトロ千代田線", "東京メトロ有楽町線", "東京メトロ半蔵門線", "東京メトロ南北線", "東京メトロ副都心線", "西武有楽町線", "西武新宿線", "西武池袋線", "西武国分寺線", "西武多摩川線", "西武多摩湖線", "西武豊島線", "東武東上線", "東武伊勢崎線", "東武亀戸線", "東武大師線", "東急東横線", "東急田園都市線", "東急池上線", "東急目黒線", "東急多摩川線", "東急大井町線", "東急世田谷線", "都営浅草線", "都営三田線", "都営新宿線", "都営大江戸線", "都電荒川線", "日暮里・舎人ライナー", "京王井の頭線", "京王競馬場線", "京王新線", "京王線", "京王相模原線", "京王高尾線", "京成押上線", "京成金町線", "京成本線", "京急本線", "京急空港線", "小田急線", "小田急多摩線", "多摩都市モノレール", "りんかい線", "東京モノレール", "新交通ゆりかもめ", "埼玉高速鉄道", "つくばエクスプレス", "成田スカイアクセス", "ＪＲ総武線", "ＪＲ常磐線", "ＪＲ成田線", "ＪＲ武蔵野線", "ＪＲ総武線快速", "ＪＲ総武本線", "ＪＲ京葉線", "ＪＲ外房線", "ＪＲ内房線", "東京メトロ東西線", "都営新宿線", "京成本線", "京成千葉線", "京成千原線", "新京成線", "東武野田線", "北総線", "つくばエクスプレス", "千葉都市モノレール", "流鉄流山線", "東葉高速鉄道", "ユーカリが丘線", "成田スカイアクセス", "ＪＲ高崎線", "ＪＲ八高線", "ＪＲ上越線", "ＪＲ信越本線", "湘南新宿ライン高海", "上越新幹線", "北陸新幹線", "上信電鉄", "ＪＲ宇都宮線", "ＪＲ常磐線", "ＪＲ水郡線", "湘南新宿ライン宇須", "つくばエクスプレス", "関東鉄道常総線", "鹿島臨海鉄道", "宇都宮芳賀ライトレール線", "ＪＲ宇都宮線", "ＪＲ烏山線", "ＪＲ日光線", "ＪＲ水戸線", "ＪＲ両毛線", "湘南新宿ライン宇須", "東北新幹線", "東武宇都宮線"],
                2: ["東急大井町線", "東急東横線", "東急田園都市線", "東急目黒線", "東急新横浜線", "ＪＲ横須賀線", "ＪＲ京浜東北線", "ＪＲ根岸線", "ＪＲ鶴見線", "ＪＲ東海道本線", "ＪＲ南武線", "ＪＲ横浜線", "ＪＲ相模線", "湘南新宿ライン宇須", "湘南新宿ライン高海", "東海道新幹線", "ＪＲ埼京線", "京王相模原線", "京急本線", "京急大師線", "京急久里浜線", "小田急線", "小田急小田原線", "小田急多摩線", "小田急江ノ島線", "相鉄本線", "相鉄いずみ野線", "相鉄新横浜線", "ブルーライン", "グリーンライン", "みなとみらい線", "シーサイドライン", "江ノ島電鉄線", "湘南モノレール", "箱根登山鉄道", "伊豆箱根大雄山線", "ＪＲ山手線", "ＪＲ京浜東北線", "ＪＲ東海道本線", "ＪＲ常磐線", "ＪＲ南武線", "ＪＲ横浜線", "ＪＲ横須賀線", "ＪＲ中央線", "ＪＲ青梅線", "ＪＲ武蔵野線", "ＪＲ八高線", "ＪＲ埼京線", "ＪＲ高崎線", "ＪＲ宇都宮線", "ＪＲ総武線", "ＪＲ総武線快速", "ＪＲ京葉線", "湘南新宿ライン宇須", "湘南新宿ライン高海", "東海道新幹線", "上越新幹線", "北陸新幹線", "東北新幹線", "東京メトロ銀座線", "東京メトロ丸ノ内線", "東京メトロ日比谷線", "東京メトロ東西線", "東京メトロ千代田線", "東京メトロ有楽町線", "東京メトロ半蔵門線", "東京メトロ南北線", "東京メトロ副都心線", "西武有楽町線", "西武新宿線", "西武池袋線", "西武国分寺線", "西武多摩川線", "西武多摩湖線", "西武豊島線", "東武東上線", "東武伊勢崎線", "東武亀戸線", "東武大師線", "東急東横線", "東急田園都市線", "東急池上線", "東急目黒線", "東急多摩川線", "東急大井町線", "東急世田谷線", "都営浅草線", "都営三田線", "都営新宿線", "都営大江戸線", "都電荒川線", "日暮里・舎人ライナー", "京王井の頭線", "京王競馬場線", "京王新線", "京王線", "京王相模原線", "京王高尾線", "京成押上線", "京成金町線", "京成本線", "京急本線", "京急空港線", "小田急線", "小田急多摩線", "多摩都市モノレール", "りんかい線", "東京モノレール", "新交通ゆりかもめ", "埼玉高速鉄道", "つくばエクスプレス", "成田スカイアクセス", "ＪＲ総武線", "ＪＲ常磐線", "ＪＲ成田線", "ＪＲ武蔵野線", "ＪＲ総武線快速", "ＪＲ総武本線", "ＪＲ京葉線", "ＪＲ外房線", "ＪＲ内房線", "東京メトロ東西線", "都営新宿線", "京成本線", "京成千葉線", "京成千原線", "新京成線", "東武野田線", "北総線", "つくばエクスプレス", "千葉都市モノレール", "流鉄流山線", "東葉高速鉄道", "ユーカリが丘線", "成田スカイアクセス", "ＪＲ高崎線", "ＪＲ八高線", "ＪＲ上越線", "ＪＲ信越本線", "湘南新宿ライン高海", "上越新幹線", "北陸新幹線", "上信電鉄", "ＪＲ宇都宮線", "ＪＲ常磐線", "ＪＲ水郡線", "湘南新宿ライン宇須", "つくばエクスプレス", "関東鉄道常総線", "鹿島臨海鉄道", "宇都宮芳賀ライトレール線", "ＪＲ宇都宮線", "ＪＲ烏山線", "ＪＲ日光線", "ＪＲ水戸線", "ＪＲ両毛線", "湘南新宿ライン宇須", "東北新幹線", "東武宇都宮線"],
                3: ["東急大井町線", "東急東横線", "東急田園都市線", "東急目黒線", "東急新横浜線", "ＪＲ横須賀線", "ＪＲ京浜東北線", "ＪＲ根岸線", "ＪＲ鶴見線", "ＪＲ東海道本線", "ＪＲ南武線", "ＪＲ横浜線", "ＪＲ相模線", "湘南新宿ライン宇須", "湘南新宿ライン高海", "東海道新幹線", "ＪＲ埼京線", "京王相模原線", "京急本線", "京急大師線", "京急久里浜線", "小田急線", "小田急小田原線", "小田急多摩線", "小田急江ノ島線", "相鉄本線", "相鉄いずみ野線", "相鉄新横浜線", "ブルーライン", "グリーンライン", "みなとみらい線", "シーサイドライン", "江ノ島電鉄線", "湘南モノレール", "箱根登山鉄道", "伊豆箱根大雄山線", "ＪＲ山手線", "ＪＲ京浜東北線", "ＪＲ東海道本線", "ＪＲ常磐線", "ＪＲ南武線", "ＪＲ横浜線", "ＪＲ横須賀線", "ＪＲ中央線", "ＪＲ青梅線", "ＪＲ武蔵野線", "ＪＲ八高線", "ＪＲ埼京線", "ＪＲ高崎線", "ＪＲ宇都宮線", "ＪＲ総武線", "ＪＲ総武線快速", "ＪＲ京葉線", "湘南新宿ライン宇須", "湘南新宿ライン高海", "東海道新幹線", "上越新幹線", "北陸新幹線", "東北新幹線", "東京メトロ銀座線", "東京メトロ丸ノ内線", "東京メトロ日比谷線", "東京メトロ東西線", "東京メトロ千代田線", "東京メトロ有楽町線", "東京メトロ半蔵門線", "東京メトロ南北線", "東京メトロ副都心線", "西武有楽町線", "西武新宿線", "西武池袋線", "西武国分寺線", "西武多摩川線", "西武多摩湖線", "西武豊島線", "東武東上線", "東武伊勢崎線", "東武亀戸線", "東武大師線", "東急東横線", "東急田園都市線", "東急池上線", "東急目黒線", "東急多摩川線", "東急大井町線", "東急世田谷線", "都営浅草線", "都営三田線", "都営新宿線", "都営大江戸線", "都電荒川線", "日暮里・舎人ライナー", "京王井の頭線", "京王競馬場線", "京王新線", "京王線", "京王相模原線", "京王高尾線", "京成押上線", "京成金町線", "京成本線", "京急本線", "京急空港線", "小田急線", "小田急多摩線", "多摩都市モノレール", "りんかい線", "東京モノレール", "新交通ゆりかもめ", "埼玉高速鉄道", "つくばエクスプレス", "成田スカイアクセス", "ＪＲ総武線", "ＪＲ常磐線", "ＪＲ成田線", "ＪＲ武蔵野線", "ＪＲ総武線快速", "ＪＲ総武本線", "ＪＲ京葉線", "ＪＲ外房線", "ＪＲ内房線", "東京メトロ東西線", "都営新宿線", "京成本線", "京成千葉線", "京成千原線", "新京成線", "東武野田線", "北総線", "つくばエクスプレス", "千葉都市モノレール", "流鉄流山線", "東葉高速鉄道", "ユーカリが丘線", "成田スカイアクセス", "ＪＲ高崎線", "ＪＲ八高線", "ＪＲ上越線", "ＪＲ信越本線", "湘南新宿ライン高海", "上越新幹線", "北陸新幹線", "上信電鉄", "ＪＲ宇都宮線", "ＪＲ常磐線", "ＪＲ水郡線", "湘南新宿ライン宇須", "つくばエクスプレス", "関東鉄道常総線", "鹿島臨海鉄道", "宇都宮芳賀ライトレール線", "ＪＲ宇都宮線", "ＪＲ烏山線", "ＪＲ日光線", "ＪＲ水戸線", "ＪＲ両毛線", "湘南新宿ライン宇須", "東北新幹線", "東武宇都宮線"],
                4: ["東急大井町線", "東急東横線", "東急田園都市線", "東急目黒線", "東急新横浜線", "ＪＲ横須賀線", "ＪＲ京浜東北線", "ＪＲ根岸線", "ＪＲ鶴見線", "ＪＲ東海道本線", "ＪＲ南武線", "ＪＲ横浜線", "ＪＲ相模線", "湘南新宿ライン宇須", "湘南新宿ライン高海", "東海道新幹線", "ＪＲ埼京線", "京王相模原線", "京急本線", "京急大師線", "京急久里浜線", "小田急線", "小田急小田原線", "小田急多摩線", "小田急江ノ島線", "相鉄本線", "相鉄いずみ野線", "相鉄新横浜線", "ブルーライン", "グリーンライン", "みなとみらい線", "シーサイドライン", "江ノ島電鉄線", "湘南モノレール", "箱根登山鉄道", "伊豆箱根大雄山線", "ＪＲ山手線", "ＪＲ京浜東北線", "ＪＲ東海道本線", "ＪＲ常磐線", "ＪＲ南武線", "ＪＲ横浜線", "ＪＲ横須賀線", "ＪＲ中央線", "ＪＲ青梅線", "ＪＲ武蔵野線", "ＪＲ八高線", "ＪＲ埼京線", "ＪＲ高崎線", "ＪＲ宇都宮線", "ＪＲ総武線", "ＪＲ総武線快速", "ＪＲ京葉線", "湘南新宿ライン宇須", "湘南新宿ライン高海", "東海道新幹線", "上越新幹線", "北陸新幹線", "東北新幹線", "東京メトロ銀座線", "東京メトロ丸ノ内線", "東京メトロ日比谷線", "東京メトロ東西線", "東京メトロ千代田線", "東京メトロ有楽町線", "東京メトロ半蔵門線", "東京メトロ南北線", "東京メトロ副都心線", "西武有楽町線", "西武新宿線", "西武池袋線", "西武国分寺線", "西武多摩川線", "西武多摩湖線", "西武豊島線", "東武東上線", "東武伊勢崎線", "東武亀戸線", "東武大師線", "東急東横線", "東急田園都市線", "東急池上線", "東急目黒線", "東急多摩川線", "東急大井町線", "東急世田谷線", "都営浅草線", "都営三田線", "都営新宿線", "都営大江戸線", "都電荒川線", "日暮里・舎人ライナー", "京王井の頭線", "京王競馬場線", "京王新線", "京王線", "京王相模原線", "京王高尾線", "京成押上線", "京成金町線", "京成本線", "京急本線", "京急空港線", "小田急線", "小田急多摩線", "多摩都市モノレール", "りんかい線", "東京モノレール", "新交通ゆりかもめ", "埼玉高速鉄道", "つくばエクスプレス", "成田スカイアクセス", "ＪＲ総武線", "ＪＲ常磐線", "ＪＲ成田線", "ＪＲ武蔵野線", "ＪＲ総武線快速", "ＪＲ総武本線", "ＪＲ京葉線", "ＪＲ外房線", "ＪＲ内房線", "東京メトロ東西線", "都営新宿線", "京成本線", "京成千葉線", "京成千原線", "新京成線", "東武野田線", "北総線", "つくばエクスプレス", "千葉都市モノレール", "流鉄流山線", "東葉高速鉄道", "ユーカリが丘線", "成田スカイアクセス", "ＪＲ高崎線", "ＪＲ八高線", "ＪＲ上越線", "ＪＲ信越本線", "湘南新宿ライン高海", "上越新幹線", "北陸新幹線", "上信電鉄", "ＪＲ宇都宮線", "ＪＲ常磐線", "ＪＲ水郡線", "湘南新宿ライン宇須", "つくばエクスプレス", "関東鉄道常総線", "鹿島臨海鉄道", "宇都宮芳賀ライトレール線", "ＪＲ宇都宮線", "ＪＲ烏山線", "ＪＲ日光線", "ＪＲ水戸線", "ＪＲ両毛線", "湘南新宿ライン宇須", "東北新幹線", "東武宇都宮線"],
            }
        },
    ]

    // 侧边栏隐藏事件
    const isShow = ref(false)
    if (!conditionStore.isFunctionTriggered) {
        setTimeout(() => {
            isShow.value = true
        }, 300)
        conditionStore.isFunctionTriggered = true
    }
</script>
    
<style scoped  lang='less'>
    .sidebar {
        width: 200px;
        height: 100vh;
        padding: 30px 30px;
        background-color: rgba(178, 198, 218, 0.596);
        background-color: #fff6;
        backdrop-filter: blur(18px);
        display: flex;
        flex-direction: column;
        transform: translateX(-100%);
        transition: .2s ease;
        box-shadow: inset 1px 1px 5px rgba(255, 255, 255, 0.525),
                        1px 0 15px rgba(202, 200, 200, 0.333);

        &.show {
            transform: translateX(0);
        }
                    

        .trigger {
            width: 25px;
            height: 50px;
            background-color: #eee;
            border-radius: 5px;
            position: absolute;
            right: 0;
            top: 36%;
            transform: translateX(100%);
            box-shadow: 0 0 5px #aaa;
            cursor: pointer;

            &:hover {
                box-shadow: 0 0 5px #666;
            }

            .icon {
                position: absolute;
                right: 20%;
                top: 50%;
                transform: translateY(-50%);
            }
        }

        .block {
            margin-bottom: 15px;
            font-size: 20px;
            text-align: center;
            border-bottom: 1px solid #999;
        }

        .last-search {
            height: 50px;
            padding: 4px 5px;
            border: 1px dotted #ccc;
            border-radius: 5px;
            transition: .1s ease;
            background-color: #fff;
            cursor: pointer;

            &:hover {
                box-shadow: 0 0 5px #666;
            }
        }
    }

    @media screen and (max-width: 415px) {
        .sidebar {
            width: 80vw;
        }
    }
</style>