import{_ as s,s as o,b as n,z as a,o as i,c as p,a as e,g as f}from"./index-a2ef63ca.js";const _={1:`<h1 style="text-align:center;font-size:28px">プライバシーポリシー（または個人情報保護方針）</h1><br><br>
    株式会社セブンクラウドハウス（以下「弊社」という）、弊社の個人情報保護方針につきましては、以下をご覧ください。<br>
    当社が取得した個人情報の取扱いに関し、個人情報の保護に関する法律、個人情報保護に関するガイドライン等<br>
    の指針、その他個人情報保護に関する関係法令を遵守します。<br><br>
    <b style="font-size:18px">1. 個人情報の取得、利用、提供</b><br><br>
    お客さまの個人情報の取得は、適法かつ公正な手段によってこれを行い、個人情報の利用目的等の必要事項につ<br>
    いて取得時に明示するか、弊社ウェブサイト等にて告知します。適正な手続きのもと、利用目的の範囲で個人情<br>
    報の取り扱いをいたします。<br>
    また、個人情報を第三者に提供・開示等する場合は、法令の定める手続きに則って行います。<br><br>
    <b style="font-size:18px">2. 利用する目的</b><br><br>
    弊社は、お客さまの個人情報を以下の利用目的の達成に必要な範囲で利用いたします。<br><br>
    当社の事業に関する商品・サービスの提供のため<br><br>
    ＜弊社の事業例＞<br>
    不動産の売買・賃貸、それらの代理・仲介、管理その他付帯する事業<br><br>
    ＜例として、以下の利用目的が含まれます＞<br>
    郵便物・電子メール・電話等による営業活動<br>
    住宅施設等の不動産に関するお客さまとの契約や取引の履行<br>
    提供する不動産（駐車場を含みます）の管理・運営<br>
    弊社が参画する会員組織における会員情報の管理<br>
    顧客向けサービス（ハウスクリーニング・リフォーム等）の提供<br>
    お客さまとの取引や会員向けサービスの提供に関する郵便物・電子メール・電話等によるご連絡、問い合わせ対応<br>
    弊社に保険業務の委託を行う保険会社が取り扱う商品・サービス提供<br>
    弊社および弊社のグループ各社の取り扱うお客さまの衣･食･住･遊･働に関わる商品・サービスの紹介<br><br>
    ＜例として、以下の利用目的が含まれます＞<br>
    各種セミナー・キャンペーン・イベントの案内<br>
    広告配信事業者を利用した行動ターゲティング広告（取得した閲覧履歴やサービス利用履歴等の情報を分析し、<br>
    お客さまの属性・興味関心を推定して出稿内容を変える広告手法）の配信によるサービス利用時の割引等の特典の提供<br>
    弊社が取得した取引履歴等の情報を分析し、お客さまの属性・興味関心等を推定した上での案内を含みます。<br>
    上記の案内・配信・提供は電話、封書葉書等、メールマガジン、またはダイレクトメール等により行います。<br><br>
    弊社の取り扱うお客さまの衣･食･住･遊･働に関わる、商品・サービスの開発・改善、ならびに弊社が行うお客さ<br>
    まによりよい商品・サービスをご提供するための市場調査などのマーケティング活動・調査・分析のため<br><br>
    ＜例として、以下の利用目的が含まれます＞<br>
    商品・サービスの開発および改善<br>
    アンケートの実施<br>
    販売促進活動の効果検証､販売促進計画の策定<br>
    個人関連情報の取得<br><br>
    弊社は、第三者であるデータ提供サービス事業者から Cookie や広告 ID（スマートフォン端末の識別子）等（以<br>
    下「Cookie 等」という）により収集された Web の閲覧・利用履歴およびその分析結果を取得し、これをお客さ<br>
    まの個人データと紐づけたうえで、広告配信等の目的で利用いたします。<br><br>
    <b style="font-size:18px">3. 第三者提供</b><br><br>
    弊社は、法令の規定に基づく場合のほか、上記「利用目的」に記載した利用目的の達成に必要な範囲で、お客さ<br>
    まの個人データを住宅事業の共同事業者などの第三者に提供することがあります。<br>
    提供する情報は、個別取引における氏名、住所、電話番号、物件情報、成約情報のほか、各利用目的の達成のた<br>
    めに必要な項目とさせていただきますが、必要最低限の項目に限定することとします。<br><br>
    ＜提供する個人データ例＞<br>
    弊社が取り扱う不動産に関し、内見希望・資料請求いただいた際に登録いただいた事項<br>
    不動産取引の際に届出いただいた事項<br>
    弊社が取り扱う物件に関する各種図面情報（設計施工図・パンフレット図面等）<br>
    顧客向けサービスの提供履歴等<br><br>
    ＜個人データを提供する相手先例＞<br>
    弊社のグループ各社<br>
    不動産売買・賃貸の仲介における契約相手方となる者、その見込者、他の宅地建物取引業者、インターネット広<br>
    告掲載業者・不動産事業者<br>
    団体、及び指定流通機構（物件登録、成約通知及び同機構のデータを利用しての営業、価格査定等の実施）<br>
    新規物件の販売における事業主・共同代理会社・媒介会社<br>
    不動産売買・賃貸の仲介におけるお客さまを紹介した宅建業者・代理会社・媒介会社<br>
    不動産取引の付帯業務における金融機関、司法書士、土地家屋調査士、不動産管理業者、リフォーム業者、引越し業者<br>
    月極駐車場の契約相手方となる者、その見込者、他の宅地建物取引業者、駐車場の所有者、管理会社顧客向けサービスの提供会社<br>
    第三者に提供する場合は、書面、郵便物、電話、FAX、電子メール、電子媒体などを用いて行い、安全管理に十<br>
    分に配慮して受け渡しを行うものとし、電子データを提供する場合は、暗号化する等必要な措置を講じて受け渡しを行います。<br>
    ご本人からの個人情報保護法の定めに則った申し出により、第三者への提供を停止いたします。以下記載の「株<br>
    式会社セブンクラウドハウス個人情報担当窓口」へ申し出てください。停止によりサービスの一部または全部が<br>
    受けられなくなる場合がありますので予めご承知おき願います。<br><br>
    <b style="font-size:18px">4. 共同利用</b><br><br>
    弊社は、お客様の個人データを次のとおり共同利用いたします。<br><br>
    共同利用する個人データの項目<br>
    氏名、住所、生年月日、電話番号、メールアドレス、取引履歴に関する情報等<br><br>
    ＜提供する個人データ例＞<br>
    弊社が取り扱う不動産に関し、内見希望・資料請求いただいた際に登録いただいた事項<br>
    不動産取引の際に届出いただいた事項<br>
    弊社が取り扱う物件に関する各種図面情報（設計施工図・パンフレット図面等）<br>
    サービス提供履歴等<br>
    商談・検討履歴等<br>
    共同利用する者の範囲<br>
    弊社のグループ各社<br><br>
    共同利用する者の利用目的<br>
    上記「利用目的」に記載した利用目的と同様<br><br>
    共同利用責任者<br>
    株式会社セブンクラウドハウス（会社概要）<br>
    弊社はお客さまにサービスを提供するため、取得したお客さまの個人データを弊社のグループ各社で共同で利用<br>
    し、常に最新・正確な状態で保有するよう努めさせていただきます。<br><br>
    <b style="font-size:18px">5. 利用者情報の外部送信について</b><br><br>
    下記内容にて、利用者端末から情報を送信します。<br><br>
    利用者端末から送信される利用者に関する情報の内容<br>
    利用者に関する ID・広告 ID 等の識別符号<br>
    ウェブページの閲覧•利用履歴の情報を含む Cookie<br>
    利用者の氏名、利用者以外の者の連絡先情報<br>
    送信先事業者および利用している外部サービス<br>
    以下の事業者の提供するサービスを利用するために、情報送信を行っています。<br><br>
    事業者一覧はこちら<br>
    株式会社セブンクラウドハウス（会社概要）<br><br>
    １に規定する情報の利用目的<br>
    本サービスでは、以下の目的のために、1. 「利用者端末から送信される利用者に関する情報」を収集・分析しています。<br><br>
    弊社より利用者の趣味・嗜好に応じた情報提供・広告配信を行なうため<br>
    本サービスおよびまた弊社の商品・サービスの開発・改善のため<br>
    問い合わせ受付サービスを提供するため<br>
    その他、「個人情報のお取扱いについて」に定める利用目的のため<br><br>
    <b style="font-size:18px">6. 安全管理措置のために講じている措置</b><br><br>
    弊社は関係する法令及びガイドラインを遵守し、取り扱う個人データの漏えい、滅失または毀損の防止その他<br>
    の個人データの安全管理のため、必要かつ適切な措置（以下、「安全管理措置」といいます）を以下の通り講じてまいります。<br><br>
    基本方針の策定<br>
    弊社は個人データの適正な取扱いを確保するため、基本方針を策定しています。<br><br>
    個人データの取扱いに係る規律の整備<br>
    弊社は個人データの取扱方法、責任者・担当者及びその任務等について定める社内規程を策定しています。<br><br>
    組織的安全管理措置<br>
    弊社は本部・部門に個人情報の取扱いに関する責任者として「情報セキュリティ責任者」を設置し、年度ごとに<br>
    取扱報告を行うことで安全管理措置の評価・改善を図っています。<br>
    また、安全管理措置に関する社内規程を従業員（契約社員・派遣社員を含みます）に遵守させ、従業員が法や社<br>
    内規程に違反している事実又は兆候を把握した場合は責任者へ報告・連絡する体制を整備しています。<br><br>
    人的安全管理措置<br>
    弊社は従業員に対し個人情報の適正な取り扱いに関する教育・研修を実施しています。<br><br>
    物理的・技術的安全管理措置<br>
    弊社は個人データを取り扱う区域において、従業員の入退室管理を行うとともに、個人情報を含む機器等は施錠保管しています。<br>
    また、個人データ及び個人データを取り扱う情報システムへのアクセス制御、不正ソフトウェア対策、情報シス<br>
    テムの監視等を実施しています。<br>
    例）個人データのローカルディスクへの保存禁止、認証パスワードの定期変更、操作履歴の取得・分析<br><br>
    外的環境の把握<br>
    お客様の個人データを外国に設置したサーバにおいて保管する場合は、各国における個人情報の保護に関する制<br>
    度を把握した上で安全管理措置を実施しています。詳細の確認を希望される場合は、三井不動産リアルティグル<br>
    ープ個人情報担当窓口またはお客さまの担当営業部署まで連絡してください。<br><br>
    <b style="font-size:18px">7. 個人情報の取扱いに関する相談・苦情</b><br><br>
    個人情報保護法の定めに則った、個人情報に関する内容の開示、訂正・追加・削除、利用停止・消去に関する情<br>
    報提供（以下これらを併せて「開示等」といいます）については、以下の窓口またはお客さまの担当営業部署ま<br>
    で連絡してください。<br><br>
    1.訂正・利用停止等・苦情受付窓口および開示窓口<br>
    株式会社セブンクラウドハウス 個人情報担当窓口<br>
    住所：〒101-0025 東京都千代田区神田佐久間町２－１３－３３藤波ビル４F<br>
    TEL：03（5829）5615<br>
    受付時間／10:00～13:00・14:00～17:00（火・水、祝日、ゴールデンウィーク、夏季休業日、年末年始を除く）<br><br>
    2.ダイレクトメール送付先変更・停止手続きなどのお問合せ窓口<br><br>
    お問い合わせ一覧<br>
    個人情報の開示請求等の方法<br>
    お客さまご自身の個人情報の開示を求められる場合は、所定の開示請求用紙に必要事項をご記入いただき、所定<br>
    の添付書類を同封の上、上記窓口へ郵送してください。なお、個人情報の開示にあたっては所定の手数料をご負<br>
    担いただきます。<br>
    手続の詳細は上記受付窓口へご確認ください。<br><br>
    個人情報の開示等手続きについて<br>
    東京都千代田区神田佐久間町２－１３－３３藤波ビル４F<br>
    （個人情報取扱事業者）<b>株式会社セブンクラウドハウス</b><br><br>
    2023 年 10 月 1 日 制定<br>`,2:`<h1 style="text-align:center;font-size:28px">特定個人情報保護方針</h1><br><br>
    株式会社セブンクラウドハウス及びそのグループ会社（以下「当社グループ」という。）は、個人番号その他の特<br>
    定個人情報（以下「特定個人情報等」という。）の取り扱いが安全かつ適正に行われるよう取り組むことが企業の<br>
    社会的責務であると考え、以下の保護方針に従って、特定個人情報等を適切に取り扱います。<br><br>
    <b style="font-size:18px">1. 関係法令・ガイドライン等の遵守</b><br><br>
    当社グループは、特定個人情報等に関して適用される法令、ガイドラインその他の規範を遵守します。<br><br>
    <b style="font-size:18px">2. 利用目的</b><br><br>
    当社グループは、提供を受けた特定個人情報等を、以下の目的で利用します。<br><br>
    お取引先さま等の特定個人情報等<br>
    不動産取引に関する支払調書作成事務<br>
    報酬、料金、契約金及び賞金に関する支払調書作成事務<br>
    当社グループの役職員等の特定個人情報等<br>
    税務<br>
    源泉徴収票作成事務<br>
    財形に関する申告書、届出書及び申込書提出事務<br>
    社会保険<br>
    健康保険・厚生年金保険届出事務<br>
    雇用保険・労災保険届出事務<br>
    国民年金第 3 号被保険者の届出事務<br><br>
    <b style="font-size:18px">3. 安全管理措置に関する事項</b><br><br>
    当社グループは、特定個人情報等の漏えい、滅失または毀損の防止等、その他特定個人情報等の適切な管理のた<br>
    めに、組織体制及び社内規則を整備し、これを遵守するとともに漏えい等の事故を防止するための物理的、技術<br>
    的な対策等の安全管理措置を講じます。<br><br>
    <b style="font-size:18px">4. 委託の取り扱い</b><br><br>
    当社グループは、特定個人情報等の取り扱いを委託する場合は、特定個人情報等に関して適用される法令等に従<br>
    い、特定個人情報等の安全管理が図られるよう委託先に対する必要かつ適切な監督を行います。<br><br>
    <b style="font-size:18px">5. ご質問等に関する窓口</b><br><br>
    当社グループの特定個人情報等の取り扱いに関するご質問等につきましては、以下の窓口を設け、適切かつ誠実、<br>
    迅速に対応いたします。<br><br>
    【支払調書作成及びその他のご質問等】<br>
    株式会社セブンクラウドハウス 経理部<br>
    TEL：03（5829）5615<br>
    受付時間／10:00～13:00・14:00～17:00（火・水、祝日、ゴールデンウィーク、夏季休業日、年末年始を除く）<br>
    東京都千代田区神田佐久間町２－１３－３３藤波ビル４F<br>
    （個人情報取扱事業者）<b>株式会社セブンクラウドハウス</b><br><br>
    2023 年 10 月 1 日 制定`};const l={class:"container"},c={class:"info-wrapper"},x=["innerHTML"],y={__name:"InfoPage",setup(d){const t=o(),b=n(1);return a(()=>t.params,r=>{b.value=r.infoType}),(r,z)=>(i(),p("div",l,[e("div",c,[e("p",{innerHTML:f(_)[b.value]},null,8,x)])]))}},h=s(y,[["__scopeId","data-v-dfdd703f"]]);export{h as default};
